
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |    Destroy |
|----------:|---------:|------------:|-----------:|
|        ✅ |        2 |           8 |          0 |
## Affected resources by action

|  Action  | Resources                                                                                          |
|:--------:|:---------------------------------------------------------------------------------------------------|
|    🟢    | `module.registry.aws_iam_role_policy_attachment.registry-client["terraform-aws-org-governance"]`   |
|    🟢    | `module.registry.module.registry-client-roles["terraform-aws-org-governance"].aws_iam_role.github` |
|    🟡    | `module.jumphost.aws_autoscaling_group.jumphost`                                                   |
|    🟡    | `module.jumphost.aws_iam_policy.required`                                                          |
|    🟡    | `module.jumphost.aws_launch_template.jumphost`                                                     |
|    🟡    | `module.jumphost.module.jumphost_profile.aws_iam_policy.profile`                                   |
|    🟡    | `module.openclaw.module.openclaw_pod.aws_autoscaling_group.website`                                |
|    🟡    | `module.openclaw.module.openclaw_pod.aws_launch_template.website`                                  |
|    🟡    | `module.registry.module.ecs.module.pod[0].aws_autoscaling_group.website`                           |
|    🟡    | `module.registry.module.ecs.module.pod[0].aws_launch_template.website`                             |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.jumphost.data.aws_iam_policy_document.combined_permissions will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined_permissions" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + (known after apply),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "logs:PutLogEvents",
                              + "logs:DescribeLogStreams",
                              + "logs:CreateLogStream",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:logs:us-west-1:493370826424:log-group:/aws/ec2/jumphost/production/jumphost:*",
                              + "arn:aws:logs:us-west-1:493370826424:log-group:/aws/ec2/jumphost/production/jumphost",
                            ]
                          + Sid      = "CloudWatchLogs"
                        },
                      + {
                          + Action    = "cloudwatch:PutMetricData"
                          + Condition = {
                              + StringEquals = {
                                  + "cloudwatch:namespace" = "Jumphost/System"
                                }
                            }
                          + Effect    = "Allow"
                          + Resource  = "*"
                          + Sid       = "CloudWatchMetrics"
                        },
                      + {
                          + Action   = [
                              + "ec2:DescribeVolumes",
                              + "ec2:DescribeTags",
                              + "ec2:DescribeInstances",
                              + "ec2:DescribeInstanceStatus",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                          + Sid      = "EC2Metadata"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
        ]
    }

  # module.jumphost.data.aws_iam_policy_document.required_permissions will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "required_permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ec2:DescribeInstances",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "autoscaling:DescribeAutoScalingInstances",
            ]
          + resources = [
              + "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:70d22604-e11b-4b9d-95e6-f5f41a1208d6:autoScalingGroupName/jumphost-20240223005113359100000009-02R7BZ",
            ]
        }
    }

  # module.jumphost.aws_autoscaling_group.jumphost will be updated in-place
  ~ resource "aws_autoscaling_group" "jumphost" {
        id                               = "jumphost-20240223005113359100000009-02R7BZ"
        name                             = "jumphost-20240223005113359100000009-02R7BZ"
        # (32 unchanged attributes hidden)

      ~ mixed_instances_policy {
          ~ launch_template {
              ~ launch_template_specification {
                  ~ version              = "40" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (11 unchanged blocks hidden)
    }

  # module.jumphost.aws_iam_policy.required will be updated in-place
  ~ resource "aws_iam_policy" "required" {
        id               = "arn:aws:iam::493370826424:policy/terraform-20240223005145929800000014"
        name             = "terraform-20240223005145929800000014"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "ec2:DescribeInstances"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "autoscaling:DescribeAutoScalingInstances"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:70d22604-e11b-4b9d-95e6-f5f41a1208d6:autoScalingGroupName/jumphost-20240223005113359100000009-02R7BZ"
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:DescribeLogStreams",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-west-1:493370826424:log-group:/aws/ec2/jumphost/production/jumphost:*",
                          - "arn:aws:logs:us-west-1:493370826424:log-group:/aws/ec2/jumphost/production/jumphost",
                        ]
                      - Sid      = "CloudWatchLogs"
                    },
                  - {
                      - Action    = "cloudwatch:PutMetricData"
                      - Condition = {
                          - StringEquals = {
                              - "cloudwatch:namespace" = "Jumphost/System"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                      - Sid       = "CloudWatchMetrics"
                    },
                  - {
                      - Action   = [
                          - "ec2:DescribeVolumes",
                          - "ec2:DescribeTags",
                          - "ec2:DescribeInstances",
                          - "ec2:DescribeInstanceStatus",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "EC2Metadata"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
            "environment"       = "production"
            "service"           = "jumphost"
        }
        # (7 unchanged attributes hidden)
    }

  # module.jumphost.aws_launch_template.jumphost will be updated in-place
  ~ resource "aws_launch_template" "jumphost" {
        id                                   = "lt-001743d1d2257c40b"
      ~ image_id                             = "ami-0fbb39ab267095c40" -> "ami-0cb4392603f81e5fe"
      ~ latest_version                       = 40 -> (known after apply)
        name                                 = "jumphost-20240223005113359100000009"
        tags                                 = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
            "environment"       = "production"
            "service"           = "jumphost"
        }
        # (17 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.registry.aws_iam_role_policy_attachment.registry-client["terraform-aws-org-governance"] will be created
  + resource "aws_iam_role_policy_attachment" "registry-client" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::493370826424:policy/registry-client20251123205221804700000001"
      + role       = "ih-tf-terraform-aws-org-governance-github"
    }

  # module.jumphost.module.jumphost_profile.aws_iam_policy.profile will be updated in-place
  ~ resource "aws_iam_policy" "profile" {
        id               = "arn:aws:iam::493370826424:policy/jumphost-Zv01ElhajbB620240223005112022800000002"
        name             = "jumphost-Zv01ElhajbB620240223005112022800000002"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "ec2:DescribeInstances"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "autoscaling:DescribeAutoScalingInstances"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:70d22604-e11b-4b9d-95e6-f5f41a1208d6:autoScalingGroupName/jumphost-20240223005113359100000009-02R7BZ"
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:DescribeLogStreams",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-west-1:493370826424:log-group:/aws/ec2/jumphost/production/jumphost:*",
                          - "arn:aws:logs:us-west-1:493370826424:log-group:/aws/ec2/jumphost/production/jumphost",
                        ]
                      - Sid      = "CloudWatchLogs"
                    },
                  - {
                      - Action    = "cloudwatch:PutMetricData"
                      - Condition = {
                          - StringEquals = {
                              - "cloudwatch:namespace" = "Jumphost/System"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                      - Sid       = "CloudWatchMetrics"
                    },
                  - {
                      - Action   = [
                          - "ec2:DescribeVolumes",
                          - "ec2:DescribeTags",
                          - "ec2:DescribeInstances",
                          - "ec2:DescribeInstanceStatus",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "EC2Metadata"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "created_by_module" = "infrahouse/instance-profile/aws"
        }
        # (7 unchanged attributes hidden)
    }

  # module.openclaw.module.openclaw_pod.aws_autoscaling_group.website will be updated in-place
  ~ resource "aws_autoscaling_group" "website" {
        id                               = "openc-20260310043545835700000002"
        name                             = "openc-20260310043545835700000002"
        # (33 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-035020ceb3b61bc39"
            name    = "openc-20260308173459737700000001"
          ~ version = "26" -> (known after apply)
        }

        # (15 unchanged blocks hidden)
    }

  # module.openclaw.module.openclaw_pod.aws_launch_template.website will be updated in-place
  ~ resource "aws_launch_template" "website" {
        id                                   = "lt-035020ceb3b61bc39"
      ~ image_id                             = "ami-0b686126658bc7875" -> "ami-0ea9133fa48165a00"
      ~ latest_version                       = 26 -> (known after apply)
        name                                 = "openc-20260308173459737700000001"
        tags                                 = {
            "VantaContainsEPHI"     = "false"
            "VantaContainsUserData" = "false"
            "VantaNonProd"          = "false"
            "account"               = "493370826424"
            "created_by_module"     = "infrahouse/openclaw/aws"
            "environment"           = "production"
            "service"               = "openclaw"
        }
        # (17 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.registry.module.registry-client-roles["terraform-aws-org-governance"].aws_iam_role.github will be created
  + resource "aws_iam_role" "github" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-org-governance:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::493370826424:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role for a GitHub Actions runner in repo terraform-aws-org-governance"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ih-tf-terraform-aws-org-governance-github"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "created_by_module" = "infrahouse/github-role/aws"
          + "module_version"    = "1.4.0"
        }
      + tags_all              = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/github-role/aws"
          + "environment"       = "production"
          + "module_version"    = "1.4.0"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.registry.module.ecs.module.pod[0].aws_autoscaling_group.website will be updated in-place
  ~ resource "aws_autoscaling_group" "website" {
        id                               = "terraf2025112317241042150000001d"
        name                             = "terraf2025112317241042150000001d"
        # (33 unchanged attributes hidden)

      ~ mixed_instances_policy {
          ~ launch_template {
              ~ launch_template_specification {
                  ~ version              = "8" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (16 unchanged blocks hidden)
    }

  # module.registry.module.ecs.module.pod[0].aws_launch_template.website will be updated in-place
  ~ resource "aws_launch_template" "website" {
        id                                   = "lt-050809287fd8270c4"
      ~ image_id                             = "ami-03c63e076e19ae6fa" -> "ami-08d71ef5f6fe7216f"
      ~ latest_version                       = 8 -> (known after apply)
        name                                 = "terraf2025112317240489720000001a"
        tags                                 = {
            "AmazonECSManaged"      = "true"
            "Name"                  = "terraform-registry-2"
            "VantaContainsEPHI"     = "false"
            "VantaContainsUserData" = "false"
            "VantaNonProd"          = "true"
            "account"               = "493370826424"
            "created_by_module"     = "infrahouse/website-pod/aws"
            "environment"           = "development"
            "parent_module"         = "infrahouse/ecs/aws"
            "service"               = "terraform-registry-2"
            "upstream_module"       = "infrahouse/ecs/aws"
        }
        # (17 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 2 to add, 8 to change, 0 to destroy.

Warning: Deprecated attribute

  on registry-role.tf line 19, in data "aws_iam_policy_document" "registry_node_assume":
  19:         "arn:aws:ecs:${data.aws_region.current.name}:${data.aws_caller_identity.current.account_id}:*"

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and 41 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDIsICJjaGFuZ2UiOiA4LCAiZGVzdHJveSI6IDB9fQ==
```
</details>